Revit 2027 API
IFCExportOptions(IFCExportOptions) Constructor
 Creates a copy of an IFCExportOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCExportOptions(
	IFCExportOptions from
)
Public Sub New (
	from As IFCExportOptions
)
public:
IFCExportOptions(
	IFCExportOptions^ from
)
new :
        from : IFCExportOptions -> IFCExportOptions
Parameters
from IFCExportOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCExportOptions Class
IFCExportOptions Overload
Autodesk.Revit.DB Namespace